{
  "backend/main.mo": "Main backend actor defining user profiles, file metadata, transfer records, and AI processing results with access-controlled CRUD operations using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features to remove principal ID display, avatar URL input, and avatar image rendering from ProfilePage and MobileMenu components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App, Dashboard, FileTransfer, TransferHistory, OnlineUsers, AIFeatures, QR scanner/dialog, offline features, and styling with mobile-first design patterns.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for UI components including sidebar, charts, and semantic colors.",
  "frontend/index.html": "HTML entry point with mobile viewport settings, PWA manifest link, theme color, app icons, and root div for React mounting.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, portrait orientation, and shortcuts to transfer, history, and users tabs.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, cache versioning, and background sync for failed transfers.",
  "frontend/src/App.tsx": "Main application component that sets up routing with TanStack Router, handles authentication flow with Internet Identity, manages onboarding/profile setup, and registers service worker for PWA support.",
  "frontend/src/components/AIFeatures.tsx": "Provides AI-powered features including image compression with quality slider and file recognition, displaying results in collapsible sections with options to share compressed images.",
  "frontend/src/components/BottomNavBar.tsx": "Fixed bottom navigation bar with four tabs (Transfer, History, Users, AI) that includes haptic feedback and safe area insets for mobile devices.",
  "frontend/src/components/ConnectionStatusBar.tsx": "Displays a fixed top banner showing online/offline connection status with auto-hide after reconnection and appropriate icons.",
  "frontend/src/components/DashboardDownloadsTab.tsx": "Empty file placeholder for downloads tab component.",
  "frontend/src/components/DashboardSentTab.tsx": "Empty file placeholder for sent files tab component.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state component displaying an image, title, description, and optional action button for when no content is available.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches errors and displays a fallback UI with retry and home navigation options.",
  "frontend/src/components/FileContextMenu.tsx": "Bottom sheet context menu for file actions including download, share (using Web Share API), and delete options with loading states.",
  "frontend/src/components/FileTransfer.tsx": "Main file transfer component handling file selection, upload progress, receiver selection from online users, file size validation, network warnings, and integration with AI-compressed images.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright text with app branding.",
  "frontend/src/components/Header.tsx": "Sticky header component displaying app logo, name, loading indicator, theme toggle, and menu button for authenticated users.",
  "frontend/src/components/LoginScreen.tsx": "Full-screen login page with branding card that initiates Internet Identity authentication.",
  "frontend/src/components/MobileNavDrawer.tsx": "Empty file, likely a placeholder for mobile navigation drawer component.",
  "frontend/src/components/NetworkWarningDialog.tsx": "Alert dialog warning users about uploading large files on slow or metered connections, with options to cancel or proceed.",
  "frontend/src/components/OfflineFileShare.tsx": "Empty file, likely a placeholder for offline file sharing functionality.",
  "frontend/src/components/OnboardingTutorial.tsx": "Multi-slide onboarding dialog with swipe gestures showcasing QR codes, file transfers, and AI features.",
  "frontend/src/components/OnlineUsers.tsx": "Displays a list of online users with avatars and profiles, supporting pull-to-refresh and filtering out the current user.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form collecting display name and optional avatar URL with keyboard handling for new users.",
  "frontend/src/components/QRCodeDialog.tsx": "Dialog that generates and displays a QR code for a session ID with countdown timer and download functionality.",
  "frontend/src/components/QRReceiveDialog.tsx": "Empty file, likely a placeholder for QR code scanning/receiving dialog component.",
  "frontend/src/components/QRScannerModal.tsx": "Modal component that uses device camera to scan QR codes for receiving file transfers, parses session IDs, and navigates to history tab on successful scan.",
  "frontend/src/components/ReceivedDownloadsList.tsx": "Displays a scrollable list of received files with download buttons, file metadata, and long-press context menu support for file actions.",
  "frontend/src/components/RecentlyReceived.tsx": "Card component showing the 5 most recently received files with download functionality and empty state handling.",
  "frontend/src/components/SentDownloadsList.tsx": "Displays sent files as cards with receiver information, download buttons, and long-press context menu support.",
  "frontend/src/components/SettingsDialog.tsx": "Empty file with no content.",
  "frontend/src/components/SettingsDownloadsSection.tsx": "Settings section that fetches and displays received files using ReceivedDownloadsList with loading state.",
  "frontend/src/components/SkeletonCard.tsx": "Reusable skeleton loading placeholder card with configurable height for displaying loading states.",
  "frontend/src/components/TransferHistory.tsx": "Tabbed interface for viewing transfer history with received/sent tabs, action buttons for sending/receiving files, and QR scanner integration.",
  "frontend/src/constants/branding.ts": "Exports branding constants including app name, short name, acronym, and tagline for consistent branding across the application.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useHapticFeedback.ts": "Provides haptic feedback functions (light, medium, success) using the Navigator Vibration API with different vibration patterns for mobile devices.",
  "frontend/src/hooks/useInstallPrompt.ts": "Handles PWA installation prompts by capturing the beforeinstallprompt event, checking installation status, and providing a function to trigger the install dialog.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useKeyboardHandler.ts": "Manages mobile keyboard interactions by scrolling inputs into view on focus, handling blur events, and dismissing the keyboard when tapping outside input fields.",
  "frontend/src/hooks/useLongPress.ts": "Implements long-press gesture detection for touch and mouse events with configurable delay, returning event handlers that trigger a callback after the threshold is met.",
  "frontend/src/hooks/useNetworkInfo.ts": "Monitors network connection quality using the Network Information API, detecting connection type, slow connections, data saver mode, and metered connections.",
  "frontend/src/hooks/useOnboarding.ts": "Manages onboarding flow state using localStorage to track completion status and provides a function to mark onboarding as complete.",
  "frontend/src/hooks/useOrientationLock.ts": "Controls screen orientation locking to portrait mode using the Screen Orientation API, persisting user preference in localStorage with enable/disable/toggle functions.",
  "frontend/src/hooks/usePullToRefresh.ts": "Implements pull-to-refresh gesture for touch devices, tracking vertical swipe distance from the top and triggering a refresh callback when threshold is exceeded.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend operations including user profiles, file uploads/downloads, transfers, AI processing, and admin functions with automatic cache invalidation.",
  "frontend/src/hooks/useRequestIndicator.ts": "Tracks global loading state by monitoring active React Query fetching and mutation operations, returning a boolean indicating if any requests are in progress.",
  "frontend/src/hooks/useSwipeBack.ts": "Detects right-swipe gestures from the left edge of the screen to trigger navigation back, with configurable threshold and minimal vertical movement tolerance.",
  "frontend/src/hooks/useWebShare.ts": "Wraps the Web Share API to share files from Uint8Array data, checking browser support and handling file conversion for native sharing dialogs.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, safe-area utilities for mobile devices, and a z-index layering system for modals and overlays.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard component managing four tabs (transfer, history, users, ai) with URL-based navigation, online status management, and file sharing between AI compression and transfer features.",
  "frontend/src/pages/MobileMenu.tsx": "Mobile menu page with user profile display, navigation to profile settings, app installation prompt, logout functionality, and swipe-back gesture support.",
  "frontend/src/pages/OfflineDashboard.tsx": "Empty file, likely a placeholder for offline functionality.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editing page with display name input, orientation lock toggle for mobile devices, swipe-back navigation, and keyboard handling for input fields.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker at '/sw.js' on window load to enable offline support and PWA functionality.",
  "frontend/src/utils/downloadTransferFile.ts": "Downloads transferred files by reading bytes from ExternalBlob backend objects and saving them to the device using the saveToDevice utility.",
  "frontend/src/utils/fileSizeValidation.ts": "Validates file sizes with 10MB warning threshold and 50MB error limit, and provides file size formatting utilities for display.",
  "frontend/src/utils/offlineSharePackage.ts": "Empty file, likely a placeholder for offline package sharing functionality.",
  "frontend/src/utils/qrPayload.ts": "Encodes session IDs as deep-link URLs for QR codes and parses QR payloads to extract session IDs from either URLs or raw strings.",
  "frontend/src/utils/receivedDownloads.ts": "Provides utilities to detect installable packages by extension, format file sizes and timestamps, and filter transfer history for received/sent files by current user.",
  "frontend/src/utils/saveToDevice.ts": "Saves files to device using modern File System Access API when available, with automatic fallback to traditional download link method.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from the URL.",
  "frontend/src/utils/useOnlineStatus.ts": "React hook that tracks browser online/offline status by listening to window online/offline events and returning the current connectivity state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including HSL-based color tokens, border radius variables, accordion animations, safe-area viewport height utilities, and plugins for animations and typography.",
  "project_state.json": "Project state document describing OFS as an Internet Computer-based wireless file sharing application with Internet Identity auth, user profiles, file uploads, QR-code sharing, AI features, PWA/offline mode, and a Motoko backend storing data in-memory with role-based access control."
}