{
  "backend/main.mo": "Main ICP actor defining data types (UserProfile, FileMetadata, TransferRecord, AIProcessingResult) and backend endpoints for user profiles, file uploads, and transfer records with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping two features—persisting display name on ProfilePage and showing it in FileTransfer—to their implementing files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing the purpose and notable changes of each component, hook, page, and utility.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "HTML entry point configuring PWA meta tags, icons, manifest link, and mounting the React app at the root div.",
  "frontend/public/manifest.webmanifest": "PWA web app manifest defining app name, icons, display mode, theme color, and shortcuts for Transfer, History, and Online Users tabs.",
  "frontend/public/sw.js": "Service worker implementing versioned caching with network-first strategy for API calls and cache-first for static assets, plus background sync support for failed transfers.",
  "frontend/src/App.tsx": "Root React component setting up TanStack Router with authenticated layout routes (dashboard, menu, profile, receive), service worker registration, onboarding flow, and identity-based auth gating.",
  "frontend/src/components/AIFeatures.tsx": "Provides AI-powered image compression and file recognition UI, allowing users to compress images with a quality slider and share the result, plus a mock file recognition feature.",
  "frontend/src/components/BottomNavBar.tsx": "Renders a fixed bottom navigation bar with four tabs (Transfer, History, Users, AI) and triggers haptic feedback on tab changes.",
  "frontend/src/components/ConnectionStatusBar.tsx": "Displays a fixed top banner indicating online/offline status, showing briefly when connectivity is restored after being offline.",
  "frontend/src/components/DashboardDownloadsTab.tsx": "Empty file with no content.",
  "frontend/src/components/DashboardSentTab.tsx": "Empty file with no content.",
  "frontend/src/components/DeleteConfirmationDialog.tsx": "A modal dialog with a red header and trash icon that asks the user to confirm file deletion, with cancel and confirm buttons and a loading state.",
  "frontend/src/components/EmptyState.tsx": "A reusable empty-state component that displays an illustration, title, description, and an optional action button.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches runtime errors and renders a fallback card UI with retry and home navigation options.",
  "frontend/src/components/FileContextMenu.tsx": "A bottom sheet context menu for a file that provides Download, Share (via Web Share API), and Delete actions, with a confirmation dialog before deletion.",
  "frontend/src/components/FileTransfer.tsx": "The main file transfer component that lets authenticated users select a file, choose an online recipient, and send the file via the ICP backend actor, with QR code and network warning support.",
  "frontend/src/components/Footer.tsx": "A simple footer component that displays the app name and copyright year from branding constants.",
  "frontend/src/components/Header.tsx": "Sticky app header displaying the logo, app name, a loading spinner, and (when authenticated) theme toggle and navigation menu buttons.",
  "frontend/src/components/LoginScreen.tsx": "Full-screen login page showing the app branding and an Internet Identity sign-in button with a loading state.",
  "frontend/src/components/MobileNavDrawer.tsx": "Empty file with no content.",
  "frontend/src/components/NetworkWarningDialog.tsx": "Alert dialog that warns users about uploading large files on slow or metered connections, offering cancel or proceed options.",
  "frontend/src/components/OfflineFileShare.tsx": "Empty file with no content.",
  "frontend/src/components/OnboardingTutorial.tsx": "Multi-slide onboarding dialog with swipe gesture support, dot indicators, and navigation buttons covering QR sharing, file transfers, and AI features.",
  "frontend/src/components/OnlineUsers.tsx": "Displays a list of currently online users with avatars, names, and online indicators, supporting pull-to-refresh and an empty state.",
  "frontend/src/components/ProfileSetup.tsx": "Full-screen form for new users to enter a display name and save their profile before proceeding into the app.",
  "frontend/src/components/QRCodeDialog.tsx": "Dialog that generates and displays a QR code for a file-sharing session, with a 5-minute countdown timer and expiry/error states.",
  "frontend/src/components/QRReceiveDialog.tsx": "A dialog component that displays file details from a QR-scanned transfer record, fetches the sender's profile, and allows the user to download the received file.",
  "frontend/src/components/QRScannerModal.tsx": "A full-screen modal that activates the device camera to scan QR codes, parses the payload to extract a session ID, and fetches the associated transfer record on success.",
  "frontend/src/components/ReceivedDownloadsList.tsx": "Renders a list of received file transfer records for the current user, supporting download, delete, and long-press context menu actions.",
  "frontend/src/components/RecentlyReceived.tsx": "Displays a compact list of recently received file transfers with download and long-press delete/context menu functionality.",
  "frontend/src/components/SentDownloadsList.tsx": "Renders a list of sent file transfer records with download, delete confirmation dialog, and long-press context menu support.",
  "frontend/src/components/SettingsDialog.tsx": "An empty settings dialog component file with no content.",
  "frontend/src/components/SettingsDownloadsSection.tsx": "A settings section component that displays a header and description for received files and renders the ReceivedDownloadsList.",
  "frontend/src/components/SkeletonCard.tsx": "A reusable skeleton loading placeholder card with configurable height, showing icon and text shimmer elements.",
  "frontend/src/components/TransferHistory.tsx": "A tabbed view component showing sent and received transfer history lists, with a button to navigate to the QR scan/receive page.",
  "frontend/src/constants/branding.ts": "Exports a constant BRANDING object containing the app name, acronym, and tagline strings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useHapticFeedback.ts": "Provides haptic feedback utilities (light, medium, success vibration patterns) using the Navigator Vibrate API, with a flag indicating browser support.",
  "frontend/src/hooks/useInstallPrompt.ts": "Manages PWA installation state by capturing the `beforeinstallprompt` event and exposing an `isInstallable` flag and `promptInstall` function.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useKeyboardHandler.ts": "Handles mobile keyboard interactions by auto-scrolling focused inputs into view and blurring the active element when tapping outside an input.",
  "frontend/src/hooks/useLongPress.ts": "Returns event handler props that trigger a callback after a configurable press duration, supporting both touch and mouse events.",
  "frontend/src/hooks/useNetworkInfo.ts": "Reads and tracks network connection information (effective type, save-data mode, speed) using the Network Information API.",
  "frontend/src/hooks/useOnboarding.ts": "Tracks whether the user has completed onboarding by persisting a flag in localStorage, exposing a `showOnboarding` boolean and a `completeOnboarding` function.",
  "frontend/src/hooks/useOrientationLock.ts": "Manages portrait orientation locking via the Screen Orientation API, persisting the user's preference in localStorage.",
  "frontend/src/hooks/usePullToRefresh.ts": "Implements pull-to-refresh behavior by tracking touch events on a scrollable container and invoking an async refresh callback when the pull distance exceeds a threshold.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for backend operations including user profile CRUD, file uploads, and AI processing results, wiring them to the ICP actor and Internet Identity.",
  "frontend/src/hooks/useRequestIndicator.ts": "Exposes a single `isLoading` boolean derived from React Query's global fetching and mutating counters.",
  "frontend/src/hooks/useSwipeBack.ts": "Detects a right-edge swipe gesture on touch devices and calls an `onSwipeBack` callback when the swipe originates near the left edge and exceeds a distance threshold.",
  "frontend/src/hooks/useWebShare.ts": "Wraps the Web Share API to share files from a Uint8Array, exposing an `isShareSupported` flag and a `shareFile` function.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines CSS custom properties for light/dark themes using oklch colors, and adds utility classes for safe areas, z-index layering, touch actions, scrollbar styling, and a QR scan line animation.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that renders tab-based navigation (transfer, history, users, ai) driven by URL search params, manages user online status, and displays the corresponding feature component per active tab.",
  "frontend/src/pages/MobileMenu.tsx": "Slide-in mobile menu component showing user avatar/name, profile settings navigation, optional PWA install prompt, and a logout button.",
  "frontend/src/pages/OfflineDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/ProfilePage.tsx": "Profile settings page allowing users to edit and save their display name, with loading skeleton, swipe-back gesture support, and a save-success indicator.",
  "frontend/src/pages/ReceivePage.tsx": "QR code scanner page that scans a file-sharing QR code, fetches the corresponding transfer record from the backend, and presents a download UI with sender profile info.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the PWA service worker (/sw.js) on page load for offline support.",
  "frontend/src/utils/downloadTransferFile.ts": "Utility that reads bytes from an ExternalBlob, creates a browser Blob, and saves it to the device using saveToDevice.",
  "frontend/src/utils/fileSizeValidation.ts": "Provides file size validation returning ok/warning/error status with thresholds at 10 MB and 50 MB, plus a formatFileSize helper.",
  "frontend/src/utils/offlineSharePackage.ts": "Empty file with no content.",
  "frontend/src/utils/qrPayload.ts": "Encodes a session ID into a deep-link URL for QR generation and parses QR payloads (URL or raw string) back to a session ID.",
  "frontend/src/utils/receivedDownloads.ts": "Utility functions for formatting file sizes and timestamps, detecting installable file types, and filtering transfer history records by sender or receiver principal.",
  "frontend/src/utils/saveToDevice.ts": "Provides a `saveToDevice` utility that saves a Blob to the user's device using the File System Access API when available, falling back to a traditional anchor-tag download.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/src/utils/useOnlineStatus.ts": "A React hook that tracks and returns the browser's online/offline status by listening to the `online` and `offline` window events.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (oklch/hsl CSS variables), mobile-optimized font sizes, safe-area spacing, dynamic viewport height utilities, and several plugins.",
  "project_state.json": "Tracks the project's current state, existing features (persisting display name to backend and showing it on the Transfer screen), and a pending feature request to save and display the name end-to-end."
}