{
  "kind": "build_request",
  "title": "Save display name and show it on Transfer screen",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the ProfilePage, after the user clicks 'Save Changes', persist the updated display name to the backend and immediately reflect the new name in the local query cache so it is available app-wide.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "after clicking on save changes make that save name"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Save Changes' on ProfilePage triggers the update-profile mutation with the entered display name.",
        "The mutation result updates the cached user profile query so the new name is immediately available without a page reload.",
        "A success indicator (toast or inline message) is shown after the name is saved."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the Transfer screen (FileTransfer component inside the Dashboard's transfer tab), display the current user's saved display name — for example, as a greeting or sender label — using the profile data from the React Query user-profile hook.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "show on transfer screen"
        ]
      },
      "acceptanceCriteria": [
        "The Transfer screen reads the authenticated user's display name from the cached profile query.",
        "The display name is rendered visibly on the Transfer screen (e.g., 'Sending as: [Name]' or a greeting header).",
        "After saving a new name on ProfilePage and navigating back to the Transfer screen, the updated name is shown without requiring an app reload.",
        "If no name is set, a sensible fallback (e.g., 'Anonymous' or truncated principal) is shown."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All backend logic must remain in the single main actor in backend/main.mo."
  ],
  "nonGoals": [
    "Redesigning the Transfer screen layout beyond adding the display name.",
    "Adding new backend endpoints beyond what is needed to persist and retrieve the display name.",
    "Changing the onboarding or profile setup flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}