{
  "kind": "build_request",
  "title": "Open QR scanner on a dedicated full-screen receive page",
  "projectName": "OFS File Share",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a new dedicated `/receive` route (page) in the router that renders a full-screen QR scanner experience. This page should display the camera viewfinder, scan a QR code, fetch the associated transfer record, and show the file receive/download UI — all without overlaying a modal on top of the existing dashboard. The page should include a back/close button that navigates the user back to the previous screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "when a reciever scanner the scanner just open on new screen to recieve files"
        ]
      },
      "acceptanceCriteria": [
        "A new `/receive` route exists and renders a dedicated full-screen page.",
        "The page shows the camera viewfinder for scanning a QR code (reusing QRScannerModal logic).",
        "After a successful scan, the file details and download UI (from QRReceiveDialog) are shown on the same screen without a separate modal.",
        "A back/close button navigates the user back to the previous screen.",
        "The scanner page is not a modal overlay on the dashboard."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the QR scanner trigger in TransferHistory (and any other location that opens the QR scanner modal) so that tapping the scan button navigates to the new `/receive` route instead of opening QRScannerModal as a modal dialog.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "when a reciever scanner the scanner just open on new screen to recieve files"
        ]
      },
      "acceptanceCriteria": [
        "Tapping the scan/receive QR button in TransferHistory navigates to `/receive` instead of opening a modal.",
        "The existing QRScannerModal and QRReceiveDialog components are no longer used as modals in the receiver flow.",
        "No regression in the sender QR code generation flow (QRCodeDialog remains unchanged)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Do not change the QR code generation (sender) flow — only the receiver scanner flow is affected.",
    "Reuse existing QRScannerModal and QRReceiveDialog logic; extract into the new page rather than duplicating."
  ],
  "nonGoals": [
    "Changing the backend API or data models.",
    "Modifying the sender's QR code generation dialog.",
    "Adding new file transfer features beyond the receive screen."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}