{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Save display name and show it on Transfer screen",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Persist updated display name from ProfilePage to backend and immediately reflect in local query cache",
      "acceptanceCriteria": [
        "Clicking 'Save Changes' on ProfilePage triggers the update-profile mutation with the entered display name.",
        "The mutation result updates the cached user profile query so the new name is immediately available without a page reload.",
        "A success indicator (toast or inline message) is shown after the name is saved."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Wire the Save Changes button to call the saveCallerUserProfile mutation from useQueries with the updated display name. After successful mutation, use queryClient.setQueryData to update the ['currentUserProfile'] cache entry immediately. Add a success toast or inline message using a toast notification or temporary state flag. Ensure the mutation invalidates ['currentUserProfile'] so dependent components refetch if needed."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the useSaveCallerUserProfile mutation hook is configured to call actor.saveCallerUserProfile with the UserProfile parameter. Add onSuccess callback that invalidates the ['currentUserProfile'] query key via queryClient.invalidateQueries so the updated profile propagates app-wide. Verify the mutation returns void as per the backend interface."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Display the current user's saved display name on the Transfer screen using cached profile data",
      "acceptanceCriteria": [
        "The Transfer screen reads the authenticated user's display name from the cached profile query.",
        "The display name is rendered visibly on the Transfer screen (e.g., 'Sending as: [Name]' or a greeting header).",
        "After saving a new name on ProfilePage and navigating back to the Transfer screen, the updated name is shown without requiring an app reload.",
        "If no name is set, a sensible fallback (e.g., 'Anonymous' or truncated principal) is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileTransfer.tsx",
          "operation": "modify",
          "description": "Import and call useGetCallerUserProfile from useQueries to fetch the current user's profile. Extract the displayName from the returned userProfile object. Add a visible UI element (e.g., a greeting header or sender label such as 'Sending as: [displayName]') near the top of the transfer form. If userProfile is null or displayName is empty, display a fallback label (e.g., 'Anonymous' or truncate the identity principal). Ensure the component re-renders when the profile query data updates so the new name appears immediately after saving on ProfilePage."
        }
      ]
    }
  ]
}