{
  "backend/main.mo": "Main backend actor implementing user profiles, file metadata storage, transfer records, AI processing results, and access control with permission checks for all operations.",
  "feature_evidence.json": "Feature evidence report documenting three features for adding Send/Receive action buttons in TransferHistory component with navigation and QR scanner modal integration.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including authentication, file transfer, QR scanning, offline capabilities, and mobile-optimized UI with haptic feedback.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for all UI components.",
  "frontend/index.html": "HTML entry point with PWA meta tags, viewport configuration for mobile, manifest link, and app icons for iOS and Android.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, display mode, orientation lock, and shortcuts for quick access to transfer, history, and users tabs.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, offline fallback, and background sync for failed transfers.",
  "frontend/src/App.tsx": "Root application component with TanStack Router, authentication flow, profile setup, onboarding tutorial, orientation lock, service worker registration, and error boundary.",
  "frontend/src/components/AIFeatures.tsx": "Provides AI-powered image compression and file recognition features with quality sliders, progress indicators, and the ability to share compressed images.",
  "frontend/src/components/BottomNavBar.tsx": "Bottom navigation bar component with four tabs (Transfer, History, Users, AI) that includes haptic feedback and safe area insets for mobile devices.",
  "frontend/src/components/ConnectionStatusBar.tsx": "Displays a fixed top banner showing online/offline connection status with auto-hide functionality after reconnection.",
  "frontend/src/components/DashboardDownloadsTab.tsx": "Empty file placeholder for downloads tab component.",
  "frontend/src/components/DashboardSentTab.tsx": "Empty file placeholder for sent items tab component.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state component displaying an image, title, description, and optional action button.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches errors and displays a fallback UI with retry and home navigation options.",
  "frontend/src/components/FileContextMenu.tsx": "Bottom sheet context menu for file actions including download, share (using Web Share API), and delete functionality.",
  "frontend/src/components/FileTransfer.tsx": "Main file transfer component handling file selection, upload progress, receiver selection, file size validation, network warnings, and transfer recording with support for prefilled files from AI compression.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright information with app branding.",
  "frontend/src/components/Header.tsx": "Sticky header with app logo, loading indicator, theme toggle, and menu button for authenticated users.",
  "frontend/src/components/LoginScreen.tsx": "Login screen component with Internet Identity authentication button and app branding.",
  "frontend/src/components/MobileNavDrawer.tsx": "Empty file placeholder for mobile navigation drawer component.",
  "frontend/src/components/NetworkWarningDialog.tsx": "Alert dialog component that warns users about uploading large files on slow or metered connections, displaying file size, connection type, and potential issues with options to cancel or proceed.",
  "frontend/src/components/OfflineFileShare.tsx": "Empty file with no content.",
  "frontend/src/components/OnboardingTutorial.tsx": "Multi-slide onboarding dialog component with touch swipe support that introduces users to QR code sharing, file transfers, and AI features through three tutorial slides.",
  "frontend/src/components/OnlineUsers.tsx": "Displays a list of online users available for file sharing with their avatars and profiles, featuring pull-to-refresh functionality and loading/empty states.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form component that collects user display name and optional avatar URL during initial setup, with keyboard handling and validation.",
  "frontend/src/components/QRCodeDialog.tsx": "Dialog component that generates and displays a QR code for a session ID with expiry countdown timer and download functionality, using the qrcode.js library.",
  "frontend/src/components/QRReceiveDialog.tsx": "Empty file with no content.",
  "frontend/src/components/QRScannerModal.tsx": "Modal dialog that provides QR code scanning functionality using device camera, parses scanned session IDs, and handles camera permissions with error states and haptic feedback.",
  "frontend/src/components/ReceivedDownloadsList.tsx": "Displays a list of received file transfers with download buttons, file metadata (name, size, type, timestamp), and long-press context menu support for mobile interactions.",
  "frontend/src/components/RecentlyReceived.tsx": "Shows a card displaying the 5 most recently received files with download functionality, loading states, and an empty state when no files have been received.",
  "frontend/src/components/SentDownloadsList.tsx": "Renders a list of sent file transfers showing file details and recipient information, with download capability and long-press context menu support.",
  "frontend/src/components/SettingsDialog.tsx": "Empty file with no content.",
  "frontend/src/components/SettingsDownloadsSection.tsx": "Settings section component that fetches and displays received files using ReceivedDownloadsList, with loading state handling.",
  "frontend/src/components/SkeletonCard.tsx": "Reusable skeleton loading placeholder component that displays a card with animated skeleton elements for file list items.",
  "frontend/src/components/TransferHistory.tsx": "Main transfer history view with tabs for received/sent files, action buttons for sending/receiving files, QR scanner integration, and empty/loading states.",
  "frontend/src/constants/branding.ts": "Defines application branding constants including app name, short name, acronym, and tagline for consistent branding across the app.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, handling authentication with Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useHapticFeedback.ts": "Custom hook providing haptic feedback functions (light, medium, success vibrations) with browser vibration API support detection.",
  "frontend/src/hooks/useInstallPrompt.ts": "Hook that manages PWA installation prompt state, detects if app is already installed, and provides a function to trigger the install prompt.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useKeyboardHandler.ts": "Custom hook that manages mobile keyboard interactions by scrolling inputs into view on focus, handling blur events, and dismissing keyboard when tapping outside input fields.",
  "frontend/src/hooks/useLongPress.ts": "Provides long-press gesture detection for both touch and mouse events with configurable delay, returning event handlers that trigger a callback after the threshold is met.",
  "frontend/src/hooks/useNetworkInfo.ts": "Hook that monitors network connection quality using the Network Information API, detecting connection type (4g/3g/2g), slow connections, and data saver mode.",
  "frontend/src/hooks/useOnboarding.ts": "Manages onboarding flow state using localStorage to track completion status and provides methods to show/hide and complete the onboarding experience.",
  "frontend/src/hooks/useOrientationLock.ts": "Hook that manages screen orientation locking to portrait mode using the Screen Orientation API, with persistent preference storage and support detection.",
  "frontend/src/hooks/usePullToRefresh.ts": "Implements pull-to-refresh gesture for mobile interfaces by tracking touch events and triggering a refresh callback when pull distance exceeds threshold.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend operations including user profiles, file uploads/downloads, transfers, AI processing, and sharing functionality with proper cache invalidation.",
  "frontend/src/hooks/useRequestIndicator.ts": "Simple hook that aggregates React Query's fetching and mutating states to provide a unified loading indicator for all active requests.",
  "frontend/src/hooks/useSwipeBack.ts": "Detects right-swipe gestures from the left edge of the screen to trigger navigation back actions, commonly used for mobile navigation patterns.",
  "frontend/src/hooks/useWebShare.ts": "Wrapper hook for the Web Share API that enables native file sharing on supported platforms, converting file data to shareable format with proper error handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color system for light/dark themes, safe area insets for mobile devices, and z-index layering for modals and dialogs.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for ICP authentication context.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard component with tab navigation (transfer, history, users, ai) that manages online status, handles URL-based tab routing, and coordinates file sharing between AI features and file transfer.",
  "frontend/src/pages/MobileMenu.tsx": "Mobile menu page with user profile display, navigation to profile settings, app installation prompt, logout functionality, and swipe-back gesture support.",
  "frontend/src/pages/OfflineDashboard.tsx": "Empty file, likely a placeholder for offline functionality.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editing page allowing users to update display name and avatar URL, with orientation lock toggle, keyboard handling, and swipe-back navigation.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker for offline PWA support when the page loads.",
  "frontend/src/utils/downloadTransferFile.ts": "Downloads transferred files by reading bytes from ExternalBlob and saving to device using the saveToDevice utility.",
  "frontend/src/utils/fileSizeValidation.ts": "Validates file sizes with warnings at 10MB and errors at 50MB, and provides file size formatting utilities.",
  "frontend/src/utils/offlineSharePackage.ts": "Empty file, likely a placeholder for offline sharing functionality.",
  "frontend/src/utils/qrPayload.ts": "Encodes session IDs as deep-link URLs for QR codes and parses QR payloads to extract session IDs from URLs or raw strings.",
  "frontend/src/utils/receivedDownloads.ts": "Utilities for filtering transfer history by sender/receiver, detecting installable packages by extension, and formatting file sizes and timestamps.",
  "frontend/src/utils/saveToDevice.ts": "Saves files to device using File System Access API with fallback to traditional download link approach.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting URL parameters from query strings or hash-based routing, with sessionStorage persistence and cleanup functions.",
  "frontend/src/utils/useOnlineStatus.ts": "React hook that tracks browser online/offline status using navigator.onLine and window events.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom color tokens (using CSS variables), extended animations for accordions, safe-area viewport height utilities, and plugins for animations and typography.",
  "project_state.json": "Project state document describing OFS as an IC-based wireless file sharing app with Internet Identity auth, user profiles, file uploads, QR sharing, AI features, PWA/offline mode, and Motoko backend with role-based access control and in-memory storage."
}