{
  "backend/main.mo": "Main backend actor with user profiles, file metadata, transfer records, and AI processing results, using mixins for authorization and blob storage with access control enforced on all operations.",
  "feature_evidence.json": "Feature evidence report documenting that FileTransfer.tsx should immediately reflect updated display names after profile setup without requiring page refresh.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and utilities with details about mobile optimization, authentication flow, and offline capabilities.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system variables for light and dark themes, including sidebar and chart color definitions.",
  "frontend/index.html": "HTML entry point with mobile viewport settings, PWA manifest, theme color, and app icons for iOS and Android.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, portrait orientation, and shortcuts to transfer, history, and users tabs.",
  "frontend/public/sw.js": "Service worker implementing cache-first for static assets, network-first for API calls, cache versioning, and background sync for failed transfers.",
  "frontend/src/App.tsx": "Root application component with TanStack Router, authentication flow, profile setup check, onboarding tutorial, orientation lock, service worker registration, and theme provider.",
  "frontend/src/components/AIFeatures.tsx": "Provides AI-powered image compression and file recognition features with quality slider, preview, and share functionality. Uses canvas API for client-side image compression and displays results in collapsible sections.",
  "frontend/src/components/BottomNavBar.tsx": "Fixed bottom navigation bar with four tabs (Transfer, History, Users, AI) that includes haptic feedback and safe area insets for mobile devices.",
  "frontend/src/components/ConnectionStatusBar.tsx": "Displays a fixed top banner showing online/offline connection status with auto-hide after reconnection and safe area support.",
  "frontend/src/components/DashboardDownloadsTab.tsx": "Empty file placeholder for downloads tab component.",
  "frontend/src/components/DashboardSentTab.tsx": "Empty file placeholder for sent items tab component.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state component displaying an image, title, description, and optional action button for empty views.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches errors and displays a fallback UI with retry and home navigation options.",
  "frontend/src/components/FileContextMenu.tsx": "Bottom sheet context menu for file actions including download, share (using Web Share API), and delete with loading states.",
  "frontend/src/components/FileTransfer.tsx": "Main file transfer component handling file selection, upload progress, receiver selection, network validation, and transfer recording with support for prefilled files from AI compression.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright text with app branding.",
  "frontend/src/components/Header.tsx": "Sticky header with app logo, loading indicator, theme toggle, and menu button for authenticated users with safe area support.",
  "frontend/src/components/LoginScreen.tsx": "Login screen with Internet Identity authentication button, app branding, and loading state for unauthenticated users.",
  "frontend/src/components/MobileNavDrawer.tsx": "Empty file placeholder for mobile navigation drawer component.",
  "frontend/src/components/NetworkWarningDialog.tsx": "Alert dialog component that warns users about uploading large files on slow or metered connections, displaying file size, connection type, and potential issues with options to cancel or proceed.",
  "frontend/src/components/OfflineFileShare.tsx": "Empty file with no content.",
  "frontend/src/components/OnboardingTutorial.tsx": "Multi-slide onboarding tutorial dialog with touch swipe support, showing three feature slides (QR codes, file transfers, AI features) with navigation controls and skip functionality.",
  "frontend/src/components/OnlineUsers.tsx": "Displays a list of online users available for file sharing with avatars, display names, and online status badges, featuring pull-to-refresh and loading states.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form component that collects user display name and optional avatar URL, with keyboard handling and validation before saving to backend.",
  "frontend/src/components/QRCodeDialog.tsx": "Dialog that generates and displays a QR code for a session ID with countdown timer, expiry handling, and download functionality using the qrcode library.",
  "frontend/src/components/QRReceiveDialog.tsx": "Empty file with no content.",
  "frontend/src/components/QRScannerModal.tsx": "Modal dialog that uses device camera to scan QR codes, parses session IDs from scanned data, and provides error handling with haptic feedback on successful scans.",
  "frontend/src/components/ReceivedDownloadsList.tsx": "Displays a list of received file transfers with download buttons, file metadata (name, size, type, timestamp), and long-press context menu support for mobile interactions.",
  "frontend/src/components/RecentlyReceived.tsx": "Shows a card displaying the 5 most recently received files with download functionality, loading states, and an empty state when no files have been received.",
  "frontend/src/components/SentDownloadsList.tsx": "Renders a list of files sent by the current user, showing receiver information, file metadata, download buttons, and long-press context menu support.",
  "frontend/src/components/SettingsDialog.tsx": "Empty file with no content.",
  "frontend/src/components/SettingsDownloadsSection.tsx": "Settings section component that fetches and displays received files using ReceivedDownloadsList, with loading state handling.",
  "frontend/src/components/SkeletonCard.tsx": "Reusable skeleton loading placeholder component that displays a card with animated skeleton elements for file list items.",
  "frontend/src/components/TransferHistory.tsx": "Main transfer history view with tabs for received/sent files, action buttons for sending/receiving files, QR scanner integration, and empty/loading states.",
  "frontend/src/constants/branding.ts": "Defines application branding constants including app name, short name, acronym, and tagline for consistent branding across the app.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, handling identity changes and query invalidation.",
  "frontend/src/hooks/useHapticFeedback.ts": "Custom hook providing haptic feedback functions (light, medium, success) using the Vibration API with feature detection.",
  "frontend/src/hooks/useInstallPrompt.ts": "Hook managing PWA installation prompt state and functionality, detecting if app is installable or already installed, and triggering the install prompt.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useKeyboardHandler.ts": "Custom hook that manages mobile keyboard interactions by scrolling inputs into view on focus, handling blur events, and dismissing keyboard when tapping outside input fields.",
  "frontend/src/hooks/useLongPress.ts": "Custom hook that detects long press gestures on touch and mouse events with configurable delay, providing event handlers for touch/mouse start, end, move, and leave.",
  "frontend/src/hooks/useNetworkInfo.ts": "Custom hook that monitors network connection quality using the Network Information API, detecting connection type, slow connections, metered networks, and data saver mode.",
  "frontend/src/hooks/useOnboarding.ts": "Custom hook that manages onboarding flow state using localStorage, tracking whether the user has completed onboarding and providing a function to mark it complete.",
  "frontend/src/hooks/useOrientationLock.ts": "Custom hook that manages screen orientation locking to portrait mode using the Screen Orientation API, with localStorage persistence and support detection.",
  "frontend/src/hooks/usePullToRefresh.ts": "Custom hook implementing pull-to-refresh functionality for mobile, tracking touch gestures and triggering refresh callback when pull distance exceeds threshold.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend operations including user profiles, file uploads/downloads, transfers, AI processing, and file sharing with automatic cache invalidation.",
  "frontend/src/hooks/useRequestIndicator.ts": "Custom hook that aggregates React Query fetching and mutation states to provide a single loading indicator for all ongoing requests.",
  "frontend/src/hooks/useSwipeBack.ts": "Custom hook that detects right swipe gestures from the left edge of the screen to trigger back navigation, commonly used for mobile navigation patterns.",
  "frontend/src/hooks/useWebShare.ts": "Custom hook that wraps the Web Share API to enable native file sharing on supported devices, converting Uint8Array blobs to shareable File objects.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color scheme for light/dark themes, safe area insets for mobile devices, and z-index layering system for modals and dialogs.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for ICP authentication context.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard component with tab navigation (transfer, history, users, ai) that manages online status, handles URL-based tab routing, and coordinates file sharing between AI features and file transfer.",
  "frontend/src/pages/MobileMenu.tsx": "Mobile menu page with user profile display, navigation to profile settings, install app prompt, logout functionality, and swipe-back gesture support.",
  "frontend/src/pages/OfflineDashboard.tsx": "Empty file, likely a placeholder for offline dashboard functionality.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editing page allowing users to update display name and avatar URL, with orientation lock toggle, keyboard handling, and swipe-back navigation.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker for offline support and PWA functionality when the page loads.",
  "frontend/src/utils/downloadTransferFile.ts": "Downloads transferred files by reading bytes from ExternalBlob and saving to device using the saveToDevice utility.",
  "frontend/src/utils/fileSizeValidation.ts": "Validates file sizes with warning at 10MB and error at 50MB, and provides file size formatting utilities.",
  "frontend/src/utils/offlineSharePackage.ts": "Empty file, likely a placeholder for offline sharing package functionality.",
  "frontend/src/utils/qrPayload.ts": "Encodes session IDs as deep-link URLs for QR codes and parses QR payloads to extract session IDs from URLs or raw strings.",
  "frontend/src/utils/receivedDownloads.ts": "Utilities for filtering transfer history by sender/receiver, detecting installable packages, and formatting file sizes and timestamps.",
  "frontend/src/utils/saveToDevice.ts": "Saves files to device using modern File System Access API with fallback to traditional download link approach.",
  "frontend/src/utils/urlParams.ts": "Comprehensive URL parameter utilities supporting hash-based routing, sessionStorage persistence, and parameter extraction/clearing from URLs.",
  "frontend/src/utils/useOnlineStatus.ts": "React hook that tracks browser online/offline status using navigator.onLine and window events.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom color tokens (using CSS variables), extended theme utilities for safe-area viewport heights, accordion animations, and plugins for animations and typography.",
  "project_state.json": "Project state document describing OFS as an IC-based wireless file sharing app with Internet Identity auth, user profiles, file uploads, QR sharing, AI features, PWA/offline mode, and a Motoko backend storing data in-memory with role-based access control."
}