{
  "backend/main.mo": "Defines user profiles, file metadata, transfer records, AI processing results, and QR sessions with access‑controlled CRUD methods and file upload logic using mixin-based authorization and blob storage.",
  "feature_evidence.json": "Lists feature evidence records mapping features to relevant frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables and dark-mode overrides for the app.",
  "frontend/index.html": "Main HTML entry point that loads the React app and registers PWA metadata including manifest and icons.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, theme, icons, and standalone display configuration.",
  "frontend/public/sw.js": "Service worker providing offline caching of static assets and an app shell with cache-first fetch handling.",
  "frontend/src/App.tsx": "Root React component that switches between offline guest mode, profile setup, or authenticated dashboard and registers the service worker.",
  "frontend/src/components/AIFeatures.tsx": "Provides UI and logic for AI-based image compression and file recognition, managing file selection, compression progress, backend upload, and success dialogs.",
  "frontend/src/components/FileTransfer.tsx": "Handles file selection, drag-and-drop, uploading, QR-based transfers, and tracking transfer progress between online users.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding text.",
  "frontend/src/components/Header.tsx": "Displays the site header with branding, theme toggle, and user authentication/account controls.",
  "frontend/src/components/LoginScreen.tsx": "Shows a login UI with branding and triggers Internet Identity authentication.",
  "frontend/src/components/OfflineFileShare.tsx": "Enables exporting/importing offline share packages and saving imported files to the device.",
  "frontend/src/components/OnlineUsers.tsx": "Displays a list of online users with profile info and loading states for file-sharing availability.",
  "frontend/src/components/ProfileSetup.tsx": "Form component for creating a user profile by submitting a display name via a mutation hook, with success and error toasts.",
  "frontend/src/components/QRCodeDialog.tsx": "Generates a QR code session for a selected file, uploads the file, and displays a dynamically rendered QR image for sharing.",
  "frontend/src/components/QRScannerModal.tsx": "Modal that activates the camera to scan QR codes, fetches associated file metadata, and triggers file transfer when valid.",
  "frontend/src/components/TransferHistory.tsx": "Displays a user's file transfer history with details like size, type, timestamps, and sender/receiver context.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, online status, user lists, and file operations using the app's actor and identity context.",
  "frontend/src/index.css": "Sets global Tailwind CSS layers and design tokens for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the app by mounting React, providing React Query and Internet Identity contexts.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard with tabs for file transfer, history, users, and AI features, managing online status and prefilled files.",
  "frontend/src/pages/OfflineDashboard.tsx": "Renders an offline-only interface for sharing files locally and explains the offline sharing process.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers a service worker on page load to enable offline capabilities.",
  "frontend/src/utils/offlineSharePackage.ts": "Creates and imports self-contained HTML packages for offline file sharing by embedding files as base64.",
  "frontend/src/utils/saveToDevice.ts": "Saves a file to the device via the File System Access API with a fallback to a download link.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session parameters for routing and state persistence.",
  "frontend/src/utils/useOnlineStatus.ts": "Tracks browser online/offline status via event listeners and exposes a boolean flag.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project’s current feature set and state, outlining existing Internet Computer–based auth, storage, and file‑sharing functionality."
}