{
  "backend/main.mo": "Motoko canister managing user profiles, file metadata, transfer records, and AI processing results with access-control‐protected CRUD operations and blob storage mixins.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing app structure, hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base and theme variable definitions implementing light and dark color schemes.",
  "frontend/index.html": "Root HTML page loading the main React app and including metadata, manifest, and icon links.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and startup behavior.",
  "frontend/public/sw.js": "Service worker implementing caching, offline fallback, and asset versioning for the PWA.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup, offline mode, and layout structure.",
  "frontend/src/components/AIFeatures.tsx": "UI for image compression and file recognition with upload, processing, progress tracking, and backend recording.",
  "frontend/src/components/DashboardDownloadsTab.tsx": "Dashboard tab displaying received file downloads from transfer history with loading state.",
  "frontend/src/components/DashboardSentTab.tsx": "Loads transfer history, filters sent files for the current user, and displays them or a loading spinner.",
  "frontend/src/components/FileTransfer.tsx": "Handles file selection, drag-and-drop, receiver selection, upload flow, and recording transfers with progress tracking.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer showing the app name and year.",
  "frontend/src/components/Header.tsx": "Displays the app header with branding, theme toggle, user menu, and logout handling.",
  "frontend/src/components/LoginScreen.tsx": "Shows the login UI with Internet Identity authentication and optional offline mode entry.",
  "frontend/src/components/OfflineFileShare.tsx": "Provides offline export/import of packaged files and saving extracted files to the device.",
  "frontend/src/components/OnlineUsers.tsx": "Lists online users excluding the current user, showing profiles and online status with loading handling.",
  "frontend/src/components/ProfileSetup.tsx": "Allows new users to enter and save a display name to complete their profile.",
  "frontend/src/components/QRCodeDialog.tsx": "Empty component file.",
  "frontend/src/components/QRReceiveDialog.tsx": "Empty component file.",
  "frontend/src/components/QRScannerModal.tsx": "Empty component file.",
  "frontend/src/components/ReceivedDownloadsList.tsx": "Lists received files with metadata and allows downloading while showing loading and toast states.",
  "frontend/src/components/RecentlyReceived.tsx": "Fetches recent transfer history, filters received files, and displays up to five with download support.",
  "frontend/src/components/SentDownloadsList.tsx": "Shows files the user has sent and lets them re-download each with loading and toast feedback.",
  "frontend/src/components/SettingsDialog.tsx": "Dialog for editing and updating user profile fields like display name and avatar URL.",
  "frontend/src/components/SettingsDownloadsSection.tsx": "Loads received transfers and displays them in a scrollable list within settings.",
  "frontend/src/components/TransferHistory.tsx": "Displays full transfer history with status, metadata, and file download actions.",
  "frontend/src/constants/branding.ts": "Exports static app branding values such as name and tagline.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks to manage Internet Identity authentication, including creating AuthClient, loading stored identities, and exposing login state and actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, online status, and related backend interactions using the authenticated actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing file transfer features, online users, notifications, and tabbed UI for transfers and AI features.",
  "frontend/src/pages/OfflineDashboard.tsx": "Offline mode dashboard enabling local file sharing and explaining offline package workflow.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load to enable offline support.",
  "frontend/src/utils/downloadTransferFile.ts": "Utility to fetch bytes from an ExternalBlob and save the resulting file to the device with error handling.",
  "frontend/src/utils/offlineSharePackage.ts": "Creates and imports self-contained HTML offline share packages embedding file data in base64.",
  "frontend/src/utils/qrPayload.ts": "Empty file with no implemented logic.",
  "frontend/src/utils/receivedDownloads.ts": "Provides helpers to detect installable file types, format sizes and timestamps, and filter transfer records for sent or received files by the current user.",
  "frontend/src/utils/saveToDevice.ts": "Implements file saving using the File System Access API with a fallback to creating a downloadable link.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/useOnlineStatus.ts": "React hook that tracks the browser’s online/offline status via window events.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, radii, animations, container settings, and plugins like typography and container-queries.",
  "project_state.json": "Describes the project's state, versioning, and a detailed list of implemented features for the OFS web application."
}