{
  "backend/main.mo": "Main Motoko actor implementing file sharing backend with user profiles, file uploads, transfer records, AI processing results, and role-based access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting iOS PWA enhancements including viewport meta tags, service worker improvements, haptic feedback implementation, and orientation lock utilities with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend TypeScript/React components covering authentication, file transfer, QR scanning, offline functionality, mobile optimizations, and utility hooks.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for UI components including sidebar, charts, and semantic colors.",
  "frontend/index.html": "HTML entry point with iOS PWA meta tags (viewport-fit=cover, apple-mobile-web-app-capable, black-translucent status bar), manifest link, and app icons for mobile installation.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, portrait orientation, theme colors, app icons (192x192, 512x512), and shortcuts for file transfer, history, and online users.",
  "frontend/public/sw.js": "Service worker implementing cache versioning (v2), network-first strategy for API calls, cache-first for static assets, background sync for failed transfers, and old cache cleanup on activation.",
  "frontend/src/App.tsx": "Main application component that sets up routing with TanStack Router, handles authentication flow with Internet Identity, manages onboarding/profile setup, and wraps the app with theme provider and error boundary.",
  "frontend/src/components/AIFeatures.tsx": "Provides AI-powered features including image compression with quality slider and file recognition, displaying results in collapsible sections with options to share compressed images.",
  "frontend/src/components/BottomNavBar.tsx": "Fixed bottom navigation bar with four tabs (Transfer, History, Users, AI) that includes haptic feedback and safe area insets for mobile devices.",
  "frontend/src/components/ConnectionStatusBar.tsx": "Displays a fixed top banner showing online/offline connection status with auto-hide after reconnection and appropriate icons.",
  "frontend/src/components/DashboardDownloadsTab.tsx": "Empty file placeholder for downloads tab component.",
  "frontend/src/components/DashboardSentTab.tsx": "Empty file placeholder for sent items tab component.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state component displaying an image, title, description, and optional action button for when no content is available.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches errors and displays a fallback UI with retry and home navigation options.",
  "frontend/src/components/FileContextMenu.tsx": "Bottom sheet context menu for file actions including download, share (using Web Share API), and delete options with loading states.",
  "frontend/src/components/FileTransfer.tsx": "Main file transfer component handling file selection, upload progress tracking, receiver selection from online users, file size validation, and network warnings with support for prefilled files from AI compression.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying the app name and copyright year with backdrop blur styling.",
  "frontend/src/components/Header.tsx": "Sticky header component displaying app logo, name, loading indicator, theme toggle, and menu button for authenticated users.",
  "frontend/src/components/LoginScreen.tsx": "Login screen with Internet Identity authentication, displaying app branding and a login button with loading state.",
  "frontend/src/components/MobileNavDrawer.tsx": "Empty file, no implementation present.",
  "frontend/src/components/NetworkWarningDialog.tsx": "Alert dialog warning users about uploading large files on slow or metered connections, with options to proceed or cancel.",
  "frontend/src/components/OfflineFileShare.tsx": "Empty file, no implementation present.",
  "frontend/src/components/OnboardingTutorial.tsx": "Multi-slide onboarding tutorial dialog with swipe navigation, showing QR codes, file transfers, and AI features with skip/next controls.",
  "frontend/src/components/OnlineUsers.tsx": "Displays a list of online users with avatars and profiles, supporting pull-to-refresh and filtering out the current user.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form for new users to enter display name and optional avatar URL with keyboard handling and validation.",
  "frontend/src/components/QRCodeDialog.tsx": "Dialog that generates and displays a QR code for a session ID with countdown timer, expiry handling, and download functionality.",
  "frontend/src/components/QRReceiveDialog.tsx": "Empty file, no implementation present.",
  "frontend/src/components/QRScannerModal.tsx": "Modal component that uses the device camera to scan QR codes, parses session IDs from the payload, and triggers callbacks with haptic feedback on successful scans.",
  "frontend/src/components/ReceivedDownloadsList.tsx": "Displays a scrollable list of received file transfers with download buttons, file metadata, and long-press context menu support for each item.",
  "frontend/src/components/RecentlyReceived.tsx": "Card component showing the 5 most recently received files with download functionality, loading states, and empty state handling.",
  "frontend/src/components/SentDownloadsList.tsx": "Renders a list of sent file transfers as cards with receiver information, download buttons, and long-press context menu support.",
  "frontend/src/components/SettingsDialog.tsx": "Empty file with no content.",
  "frontend/src/components/SettingsDownloadsSection.tsx": "Section component that fetches and displays received file transfers using ReceivedDownloadsList with loading state handling.",
  "frontend/src/components/SkeletonCard.tsx": "Reusable skeleton loading placeholder card with configurable height for displaying loading states.",
  "frontend/src/components/TransferHistory.tsx": "Tabbed interface displaying transfer history split into 'Received' and 'Sent' tabs with loading skeletons and empty states.",
  "frontend/src/constants/branding.ts": "Exports branding constants including app name variations and tagline for the Offline File Sharing application.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, handling identity changes and invalidating dependent queries when the actor updates.",
  "frontend/src/hooks/useHapticFeedback.ts": "Provides a React hook for triggering haptic feedback vibrations (light, medium, success patterns) using the navigator.vibrate API with support detection.",
  "frontend/src/hooks/useInstallPrompt.ts": "React hook that manages PWA installation prompts, detecting if the app is installable or already installed, and providing a function to trigger the install prompt.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useKeyboardHandler.ts": "React hook that handles mobile keyboard interactions by scrolling inputs into view on focus, blurring on outside taps, and providing callbacks for focus/blur events.",
  "frontend/src/hooks/useLongPress.ts": "React hook that detects long press gestures on touch and mouse events, triggering a callback after a configurable delay (default 500ms).",
  "frontend/src/hooks/useNetworkInfo.ts": "React hook that monitors network connection quality using the Network Information API, detecting connection type, slow connections, and data saver mode.",
  "frontend/src/hooks/useOnboarding.ts": "React hook that manages onboarding flow state using localStorage, showing onboarding to new users and providing a function to mark it complete.",
  "frontend/src/hooks/useOrientationLock.ts": "React hook that manages screen orientation locking to portrait mode using the Screen Orientation API, with localStorage persistence of user preference.",
  "frontend/src/hooks/usePullToRefresh.ts": "React hook implementing pull-to-refresh gesture detection with configurable threshold, triggering an async refresh callback when user pulls down from scroll top.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend operations including user profiles, file uploads/downloads, transfers, AI processing, and sharing, with proper caching and invalidation.",
  "frontend/src/hooks/useRequestIndicator.ts": "Simple React hook that combines React Query's isFetching and isMutating states to provide a unified loading indicator for all API requests.",
  "frontend/src/hooks/useSwipeBack.ts": "React hook that detects right-swipe gestures from the left edge of the screen to trigger a back navigation action, commonly used for iOS-style navigation.",
  "frontend/src/hooks/useWebShare.ts": "React hook that wraps the Web Share API to share files from the app, with support detection and proper error handling for unsupported file types.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, safe-area utilities for mobile notches, and a z-index layering system for modals and overlays.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard component with tab navigation (transfer, history, users, ai) that manages user online status, handles file sharing between AI features and transfer, and includes a bottom navigation bar.",
  "frontend/src/pages/MobileMenu.tsx": "Mobile menu page with swipe-back gesture support, displaying user profile, settings navigation, optional PWA install button, and logout functionality.",
  "frontend/src/pages/OfflineDashboard.tsx": "Empty file placeholder for offline dashboard functionality.",
  "frontend/src/pages/ProfilePage.tsx": "Profile editing page with swipe-back navigation, form inputs for display name and avatar URL, orientation lock toggle, and keyboard handling for mobile input fields.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker at '/sw.js' on window load to enable offline support and PWA functionality.",
  "frontend/src/utils/downloadTransferFile.ts": "Downloads a transferred file by reading bytes from an ExternalBlob object and saving it to the device using the saveToDevice utility.",
  "frontend/src/utils/fileSizeValidation.ts": "Validates file sizes with 10MB warning threshold and 50MB error limit, and provides a utility to format byte sizes into human-readable strings.",
  "frontend/src/utils/offlineSharePackage.ts": "Empty file placeholder for offline share package functionality.",
  "frontend/src/utils/qrPayload.ts": "Encodes session IDs as deep-link URLs for QR codes and parses QR payloads (either URLs or raw session IDs) to extract session identifiers.",
  "frontend/src/utils/receivedDownloads.ts": "Provides utilities to detect installable packages by extension, format file sizes and timestamps, and filter transfer history for received/sent files by current user.",
  "frontend/src/utils/saveToDevice.ts": "Saves files to device using modern File System Access API when available, with automatic fallback to traditional download link method if unavailable or cancelled.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/src/utils/useOnlineStatus.ts": "React hook that tracks browser online/offline status by listening to window online/offline events and returning the current connectivity state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including HSL-based color tokens, accordion animations, safe-area viewport height utilities, and plugins for animations and typography.",
  "project_state.json": "Project metadata describing OFS as an Internet Computer-based wireless file sharing app with Internet Identity auth, QR code sharing, PWA/offline support, and client-side AI features, along with architectural notes and known issues."
}