{
  "kind": "build_request",
  "title": "Add offline-first guest mode with offline share packages and save-to-device receiving",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the mandatory Internet Identity login gate so the app can open directly in a usable \"Offline (no login)\" mode, without showing the LoginScreen by default.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove login interface direcly open app"
        ]
      },
      "acceptanceCriteria": [
        "When opening the app with no authenticated Internet Identity session, the LoginScreen is not shown by default.",
        "The user can access an offline-capable UI (file pick/send/receive) without authenticating.",
        "No uncaught exceptions occur on initial load when unauthenticated."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Prevent backend-authenticated React Query hooks from running when the user is not authenticated, so anonymous/guest usage does not trigger backend authorization traps (e.g., getCallerUserProfile, getOnlineUsers, uploadFile, QR session calls).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove login interface direcly open app"
        ]
      },
      "acceptanceCriteria": [
        "With no Internet Identity session, the app does not call canister methods that require #user permission.",
        "React Query does not show repeated errors/retries caused by \"Unauthorized\" traps when unauthenticated.",
        "When authenticated, existing online features (online users list, upload, transfer history, QR session flows) still function as before."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement offline file sharing that works with zero network connectivity between sender and receiver by adding an \"Offline Share Package\" workflow: sender exports a self-contained share file (e.g., a single .html file) that embeds the selected file bytes and minimal metadata; receiver opens the share file locally (no network) and can save the embedded file to their device.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make this fully offline like if i share someone link then if he don't any network or wifi then also he can share files",
          "when we share file so file should send to reciever storage"
        ]
      },
      "acceptanceCriteria": [
        "Sender can select a file and export an offline share package without requiring authentication or network access.",
        "Receiver can open the exported share package while offline and see the embedded file name/type/size.",
        "Receiver can save/download the embedded file to device storage from the share package UI.",
        "The workflow does not require any canister calls and works when the browser reports offline (navigator.onLine === false)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a receiver-side \"Save to device\" action for any received file in offline mode, using the File System Access API when available (showSaveFilePicker) and falling back to a normal browser download when not available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "file should send to reciever storage"
        ]
      },
      "acceptanceCriteria": [
        "When a file is received/imported in offline mode, a \"Save to device\" button is available.",
        "On supported browsers, clicking \"Save to device\" prompts the user to choose a save location and writes the file.",
        "On unsupported browsers, clicking \"Save to device\" triggers a download with the correct filename and MIME type."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Make the app offline-capable after first load by caching the app shell and static assets for offline use (PWA-style), so users can reopen the app without network connectivity.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make this fully offline"
        ]
      },
      "acceptanceCriteria": [
        "After the app is loaded once while online, reopening the same URL while offline still renders the app UI (at minimum the offline mode screens).",
        "A clear, English user-facing message is shown when the user tries to use online-only features while offline (e.g., \"This feature requires an internet connection\")."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything under frontend/src/components/ui (compose them instead).",
    "Backend must remain single-actor Motoko with logic contained in backend/main.mo; only add migration.mo if existing stable state schema must change.",
    "Do not claim true device-to-device transfer via \"a link\" without any prior shared artifact; implement offline sharing via an exported share package that the receiver can open locally."
  ],
  "nonGoals": [
    "Implementing true peer-to-peer device-to-device transfer without any shared artifact (e.g., WebRTC/Bluetooth/NFC) is out of scope.",
    "Replacing Internet Identity entirely on the backend or weakening canister authorization rules for anonymous callers is out of scope.",
    "Adding external databases, third-party auth providers, or server infrastructure is out of scope."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [
      "Allow offline-first usage without mandatory login.",
      "Support offline file sharing via export/import so the receiver can save files to device storage."
    ],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}