{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Offline-first guest mode with offline share packages, save-to-device, and app-shell caching",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Allow app to open directly into an Offline (no login) mode and keep login optional.",
      "acceptanceCriteria": [
        "When opening the app with no authenticated Internet Identity session, the LoginScreen is not shown by default.",
        "The user can access an offline-capable UI (file pick/send/receive) without authenticating.",
        "No uncaught exceptions occur on initial load when unauthenticated."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the unauthenticated LoginScreen gate; render an offline-capable screen by default when identity is missing, while keeping authenticated flow (profile setup + Dashboard) intact. Also wire in service worker registration helper (created in REQ-5) without modifying frontend/src/main.tsx."
        },
        {
          "path": "frontend/src/pages/OfflineDashboard.tsx",
          "operation": "create",
          "description": "Add a dedicated offline dashboard page (no backend calls) that provides offline file pick/export/import and save-to-device actions, and includes clear UI text indicating “Offline mode (no login)” in English."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update Header to support guest/offline presentation when identity is missing: show an “Offline mode” label and a Login action (invokes useInternetIdentity().login) while hiding authenticated-only account/principal details and keeping Logout only when authenticated."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure authenticated React Query hooks and online-only effects do not run for guest/unauthenticated usage to avoid authorization traps and noisy retries.",
      "acceptanceCriteria": [
        "With no Internet Identity session, the app does not call canister methods that require #user permission.",
        "React Query does not show repeated errors/retries caused by \"Unauthorized\" traps when unauthenticated.",
        "When authenticated, existing online features (online users list, upload, transfer history, QR session flows) still function as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Guard online-status side effects and data-fetching dependencies so they only run when authenticated and when the browser is online; ensure the online status mutation is not fired in guest mode. Also add a clear English message when offline users attempt online-only tabs/features (use shared helper from REQ-5)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add safe enable/guard conditions for online-only queries/mutations (e.g., online users polling, transfer history, upload, QR session flows) so they never execute without an authenticated actor; ensure retries are disabled or reduced for auth failures to prevent repeated error loops, while preserving existing behavior for authenticated sessions."
        },
        {
          "path": "frontend/src/components/FileTransfer.tsx",
          "operation": "modify",
          "description": "Disable or hide online-only actions (receiver selection, upload/transfer, QR session creation/scanning) when unauthenticated or offline; show a clear English message (e.g., “This feature requires an internet connection” / “Login required for online transfers”) instead of triggering backend calls."
        },
        {
          "path": "frontend/src/components/QRCodeDialog.tsx",
          "operation": "modify",
          "description": "Add gating so QR session creation and backend upload are not attempted when unauthenticated or offline; present a clear English message to the user rather than failing with authorization errors."
        },
        {
          "path": "frontend/src/components/QRScannerModal.tsx",
          "operation": "modify",
          "description": "Add gating so backend QR metadata fetch is not attempted when unauthenticated or offline; present a clear English message and prevent scan-to-backend flow in those cases."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement fully offline export/import workflow via a self-contained Offline Share Package file that embeds file bytes + metadata and can be opened locally with zero network.",
      "acceptanceCriteria": [
        "Sender can select a file and export an offline share package without requiring authentication or network access.",
        "Receiver can open the exported share package while offline and see the embedded file name/type/size.",
        "Receiver can save/download the embedded file to device storage from the share package UI.",
        "The workflow does not require any canister calls and works when the browser reports offline (navigator.onLine === false)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/offlineSharePackage.ts",
          "operation": "create",
          "description": "Implement Offline Share Package generation + import helpers: (1) build a single self-contained .html string embedding base64 file bytes and minimal metadata (name/type/size); (2) trigger download of the share package; (3) parse an imported package (File) to extract embedded metadata + bytes without any network/canister calls."
        },
        {
          "path": "frontend/src/components/OfflineFileShare.tsx",
          "operation": "create",
          "description": "Create offline-only UI for: selecting a file, exporting an Offline Share Package (.html), importing a received Offline Share Package, displaying embedded metadata, and exposing a Save to device action (wired to the shared save helper from REQ-4). Must function with navigator.onLine === false and no authentication."
        },
        {
          "path": "frontend/src/pages/OfflineDashboard.tsx",
          "operation": "modify",
          "description": "Wire OfflineFileShare into the offline dashboard as the primary offline workflow UI; ensure no online-only components are rendered here."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire OfflineDashboard as the default unauthenticated experience (instead of LoginScreen), ensuring the offline share package workflow is reachable immediately on first load without login."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Provide a receiver-side “Save to device” action using the File System Access API when available, with a download fallback.",
      "acceptanceCriteria": [
        "When a file is received/imported in offline mode, a \"Save to device\" button is available.",
        "On supported browsers, clicking \"Save to device\" prompts the user to choose a save location and writes the file.",
        "On unsupported browsers, clicking \"Save to device\" triggers a download with the correct filename and MIME type."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/saveToDevice.ts",
          "operation": "create",
          "description": "Add a utility that saves a Blob/File to disk using showSaveFilePicker (when available) and falls back to a normal browser download; preserve correct filename and MIME type."
        },
        {
          "path": "frontend/src/components/OfflineFileShare.tsx",
          "operation": "modify",
          "description": "Add a prominent “Save to device” button for imported/received files, calling the shared save-to-device utility; ensure correct filename/type and proper error handling in English."
        },
        {
          "path": "frontend/src/utils/offlineSharePackage.ts",
          "operation": "modify",
          "description": "Ensure generated offline share package HTML includes a local-only “Save to device” action that uses showSaveFilePicker when available and falls back to download, without requiring any network access."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Make the app reopenable offline after first load by caching the app shell/static assets (PWA-style) and show clear messages when online-only features are attempted offline.",
      "acceptanceCriteria": [
        "After the app is loaded once while online, reopening the same URL while offline still renders the app UI (at minimum the offline mode screens).",
        "A clear, English user-facing message is shown when the user tries to use online-only features while offline (e.g., \"This feature requires an internet connection\")."
      ],
      "file_operations": [
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "create",
          "description": "Add a web app manifest enabling installability/offline-first behavior; reference existing static icons from frontend/public/assets/generated/ofs-logo-transparent.dim_200x200.png (and any other available generated icons as appropriate)."
        },
        {
          "path": "frontend/public/sw.js",
          "operation": "create",
          "description": "Add a simple service worker that caches the app shell and static assets on first online load and serves them offline (cache-first for static, network-fallback where appropriate), so the app UI can render while offline."
        },
        {
          "path": "frontend/src/pwa/registerServiceWorker.ts",
          "operation": "create",
          "description": "Create a small helper to register the service worker at runtime, with safe guards for unsupported environments; keep it importable from App without changing frontend/src/main.tsx."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the service worker on app start (e.g., via a useEffect calling the registration helper) to enable offline caching after first online load."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Wire the manifest into the HTML head (and any required meta tags) so browsers can recognize the PWA and its cached assets."
        },
        {
          "path": "frontend/src/utils/useOnlineStatus.ts",
          "operation": "create",
          "description": "Add a small React hook for tracking online/offline state (navigator.onLine + online/offline events) so UI can display clear English messaging for online-only features when offline."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Use the online-status hook to show a clear English message when offline users attempt online-only functionality; ensure offline mode UI remains usable and visible even when offline."
        }
      ]
    }
  ]
}