{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add send and receive buttons to the Receive tab",
  "requirements": [
    {
      "id": "REQ-67",
      "summary": "Add 'Send Files' and 'Receive Files' action buttons at the top of the Received tab in TransferHistory component",
      "acceptanceCriteria": [
        "Two buttons are displayed at the top of the Received tab",
        "Buttons are labeled 'Send Files' and 'Receive Files'",
        "Buttons are touch-friendly (minimum 44x44px) and visually distinct",
        "Buttons maintain the mobile-optimized design language of the app"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TransferHistory.tsx",
          "operation": "modify",
          "description": "Add two prominent action buttons labeled 'Send Files' and 'Receive Files' at the top of the Received tab content area, positioned above the ReceivedDownloadsList component. Use shadcn/ui Button component with appropriate styling (minimum 44x44px touch target, rounded corners, and consistent with app's mobile-first design). Wrap buttons in a flex container with proper spacing. These buttons should only appear when the activeTab is 'received'."
        }
      ]
    },
    {
      "id": "REQ-68",
      "summary": "Wire 'Send Files' button to switch Dashboard tab to 'transfer' programmatically",
      "acceptanceCriteria": [
        "Clicking 'Send Files' navigates to the Transfer tab in the Dashboard",
        "Navigation uses the existing tab switching mechanism (URL hash or state management)",
        "Haptic feedback is triggered on button tap"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TransferHistory.tsx",
          "operation": "modify",
          "description": "Wire the 'Send Files' button onClick handler to trigger tab navigation. Import the haptic feedback hook (useHapticFeedback) and trigger light haptic feedback on click. Use the existing URL parameter utilities (frontend/src/utils/urlParams.ts) to programmatically set the 'tab' parameter to 'transfer', which will cause the Dashboard component to switch to the transfer tab using its existing hash-based routing mechanism."
        }
      ]
    },
    {
      "id": "REQ-69",
      "summary": "Wire 'Receive Files' button to open QRScannerModal for scanning QR codes",
      "acceptanceCriteria": [
        "Clicking 'Receive Files' opens the QRScannerModal",
        "Modal uses the device camera to scan QR codes",
        "Haptic feedback is triggered on button tap",
        "Successful QR scan follows the existing session-based file receive workflow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TransferHistory.tsx",
          "operation": "modify",
          "description": "Wire the 'Receive Files' button onClick handler to open the QRScannerModal component. Add local state to control the modal open/close state. Import and use the haptic feedback hook to trigger light haptic feedback on button click. Import the QRScannerModal component (frontend/src/components/QRScannerModal.tsx) and render it conditionally based on the state. Pass appropriate props to QRScannerModal for handling scan results. The modal will use the existing qr-code/useQRScanner hook to access device camera and scan QR codes following the existing session-based file receive workflow."
        }
      ]
    }
  ]
}