{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Display user's display name on Transfer dashboard after profile save",
  "requirements": [
    {
      "id": "REQ-88",
      "summary": "Ensure FileTransfer component reflects updated display name immediately after profile save",
      "acceptanceCriteria": [
        "After a user saves their profile with a display name on the ProfilePage, the display name appears on the Transfer dashboard (FileTransfer component) immediately",
        "The display name is fetched using the existing useProfile query hook which should automatically refetch after profile updates",
        "If the profile query is not automatically invalidated after profile save, add cache invalidation to ensure the FileTransfer component receives the updated profile data",
        "The display name is prominently displayed at the top of the Transfer screen, above the file selection area (as per existing feature IF-102)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FileTransfer.tsx",
          "operation": "modify",
          "description": "Verify that the FileTransfer component correctly uses the useProfile hook to fetch and display the user's display name. Ensure the component renders the display name prominently at the top of the transfer screen. The component should automatically receive updated profile data when the query cache is invalidated by the useUpdateProfile mutation."
        }
      ]
    },
    {
      "id": "REQ-89",
      "summary": "Add query cache invalidation to useUpdateProfile mutation for automatic profile data refresh",
      "acceptanceCriteria": [
        "The useUpdateProfile mutation includes onSuccess or onSettled callback that invalidates the 'profile' query cache",
        "After profile save, all components using useProfile hook (including FileTransfer) receive the updated profile data without manual refetch",
        "Cache invalidation works correctly when navigating from ProfilePage to Dashboard Transfer tab"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Modify the useUpdateProfile mutation to include an onSuccess callback that invalidates the 'currentUserProfile' query cache using queryClient.invalidateQueries. This ensures that all components using the useProfile hook (including FileTransfer) automatically receive the updated profile data after a successful profile save. Verify that the mutation properly handles the cache invalidation to trigger immediate refetching across the application."
        }
      ]
    }
  ]
}