{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 71,
  "summary": "OFS is a web-based “wireless file sharing” application built on the Internet Computer. Users authenticate via Internet Identity, create a basic profile, appear in an online-users list, and can upload/share files. The backend (Motoko canister) stores user profiles, file metadata + blob payloads, transfer records, AI-processing audit records, and time-limited QR-code sharing sessions. The frontend (React + TanStack React Query + Tailwind/shadcn UI) provides a tabbed dashboard for file transfer, transfer history, online users, and “AI features” (client-side image compression + client-side file type/metadata recognition) with results recorded to the canister. A QR workflow exists to create a share session for a file and to scan QR codes via camera (jsQR) to fetch file metadata by session ID. The app also includes an installable PWA/offline mode with an Offline dashboard and client-side utilities to package/share files locally (device download/save) without requiring canister connectivity.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "II login",
        "AuthClient integration"
      ],
      "description": "Provides login/logout and identity persistence via @dfinity/auth-client, loading stored identity on app startup and exposing authentication state through a React Context (InternetIdentityProvider).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Canister actor creation and cache invalidation on identity change",
      "synonyms": [
        "useActor",
        "actor lifecycle"
      ],
      "description": "Creates an anonymous or authenticated canister actor depending on identity; when identity changes it invalidates and refetches non-actor React Query caches to keep data consistent per-user.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based access control with admin-token bootstrap",
      "synonyms": [
        "AccessControl",
        "admin/user/guest roles"
      ],
      "description": "Motoko access control assigns roles per principal; admin assignment is gated by an env-provided token and a user-provided secret. Includes APIs to get caller role, check admin status, and assign roles (admin-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "User profile management",
      "synonyms": [
        "Profile setup",
        "display name + avatar"
      ],
      "description": "Users can create, fetch, and update their profile (displayName, avatarUrl, online flag). The UI includes a first-login ProfileSetup flow and a header account dropdown displaying the profile.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Online presence and online user listing",
      "synonyms": [
        "Presence",
        "online status"
      ],
      "description": "Backend stores and exposes online status per user; frontend sets online on dashboard mount/unmount and polls online users every 10 seconds, displaying a list of available online users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "File upload and metadata storage",
      "synonyms": [
        "uploadFile",
        "file registry"
      ],
      "description": "Uploads file blobs to the backend and stores file metadata (id, name, size, type, uploader, uploadTime, blob). Includes a query to retrieve metadata with authorization checks (uploader/admin).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Transfer history recording and retrieval APIs",
      "synonyms": [
        "recordTransfer",
        "getTransferHistory"
      ],
      "description": "Backend supports recording transfer records (sender, receiver, file metadata, duration, success) and querying a user’s transfer history with authorization checks and time sorting. Frontend provides a TransferHistory UI to display records.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "File transfer dashboard UI",
      "synonyms": [
        "Dashboard tabs",
        "FileTransfer component"
      ],
      "description": "Tabbed dashboard with Transfer, History, Users, and AI Features. FileTransfer supports drag-and-drop multi-file selection, receiver selection from online users, per-file progress UI, and uploading selected files to the backend.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "AI features: client-side image compression workflow",
      "synonyms": [
        "AI compression",
        "canvas compression"
      ],
      "description": "Compresses images client-side via canvas/toBlob with adjustable quality, shows before/after sizes and a success dialog, and records processing results to the backend (including optional processed file blob).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "AI features: client-side file recognition/analysis workflow",
      "synonyms": [
        "File recognition",
        "metadata extraction"
      ],
      "description": "Analyzes selected files client-side (MIME/extension-based categorization) and records a recognition result payload to the backend as an AI processing record.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "AI processing result storage and queries",
      "synonyms": [
        "AIProcessingResult",
        "processing audit log"
      ],
      "description": "Backend stores AIProcessingResult records (owner, processedAt, type, metadata, optional blob) and supports querying individual results and listing all results for the caller (or admin). Frontend includes React Query hooks for these operations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "QR-code based file sharing sessions (backend)",
      "synonyms": [
        "QRCodeSession",
        "QR share sessions"
      ],
      "description": "Backend supports creating QR sessions for a file with expiry, validating sessions, invalidating sessions (creator/admin), fetching session details (creator/admin), and fetching file metadata by QR session with validity/expiry enforcement.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "QR code generation dialog (frontend)",
      "synonyms": [
        "Send via QR",
        "QRCodeDialog"
      ],
      "description": "Uploads a selected file, creates a QR session with a 5-minute expiry, renders a QR-like image on a canvas for the session ID, displays countdown messaging, and allows downloading the generated image.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "QR scanning via device camera (frontend)",
      "synonyms": [
        "Scan QR",
        "QRScannerModal"
      ],
      "description": "Implements camera access via getUserMedia with start/stop/switch camera controls, dynamically loads jsQR for decoding, and upon scan calls the backend to fetch file metadata by QR ID, then passes the result to the transfer UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Caffeine blob-storage maintenance mixin (backend)",
      "synonyms": [
        "storage gateway authorization",
        "dead blob pruning",
        "cashier refill"
      ],
      "description": "Provides maintenance endpoints for updating authorized gateway principals, listing dead blobs to delete, confirming deletion and triggering GC, checking blob liveness, and refilling cycles via a configured cashier principal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "State migration to add QR session storage",
      "synonyms": [
        "migration.mo",
        "schema evolution"
      ],
      "description": "Includes a migration runner that transforms an old actor state shape into a new shape by adding an empty qrCodeSessions map while preserving prior stored maps.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Theming and core UI shell",
      "synonyms": [
        "dark/light mode",
        "Header/Footer"
      ],
      "description": "Provides a themed application shell using next-themes (system/light/dark), a header with theme toggle and account dropdown, and a footer with OFS branding; uses Tailwind configuration and shadcn-style UI components.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Offline/PWA file sharing mode",
      "synonyms": [
        "Offline dashboard",
        "PWA offline share"
      ],
      "description": "Provides an OfflineDashboard/OfflineFileShare flow for local-only sharing when not connected to the IC backend. Includes PWA assets (manifest + service worker registration) and client-side utilities for preparing offline share packages and saving files to the device.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Reusable build-template for OFS (React + Motoko + shadcn UI) with deploy tooling",
      "synonyms": [
        "build-template",
        "ICP CLI export template",
        "docker/deploy scripts"
      ],
      "description": "Adds/updates a reusable build-template directory including Dockerfile, deploy.sh, icp.yaml, canister YAMLs, workspace package configs, image prune/resize scripts, and a vendored shadcn/ui component set + frontend tooling (ESLint rules, Vite/Tailwind configs) to standardize building/deploying the OFS stack.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "QR receive dialog (frontend) with standardized QR payload parsing",
      "synonyms": [
        "QRReceiveDialog",
        "qrPayload",
        "Receive via QR"
      ],
      "description": "Adds a dedicated receive flow for QR-based sharing that parses a standardized QR payload (e.g., session identifier) and routes it into the existing QR session metadata fetch + transfer UI flow.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Settings dialog (frontend) for app configuration and utilities",
      "synonyms": [
        "SettingsDialog",
        "client settings"
      ],
      "description": "Adds a Settings dialog in the frontend UI to expose application/settings-related actions and configuration utilities from within the dashboard shell.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Recently received files UI (frontend)",
      "synonyms": [
        "RecentlyReceived",
        "recent downloads",
        "recent transfers (received)"
      ],
      "description": "Adds a dedicated UI component to show a list of recently received/downloaded files within the dashboard experience, enabling quick access to recent inbound items after QR-based receive or transfer flows.",
      "reqIds": [],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add a dedicated top-level dashboard tab for “Sent Downloads” alongside Transfer/History/Users/AI Features (instead of placing it inside the Settings dialog).",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Internet Identity integration wrapped in a React Context provider with persisted identity loading on startup and explicit login/logout handling.",
    "Backend access is encapsulated via a generated canister actor; a custom useActor hook recreates the actor on identity changes and mass-invalidates/refetches dependent React Query caches.",
    "Motoko backend uses an explicit role-based access control module (admin/user/guest) and a mixin to expose authorization APIs; first admin assignment is gated by an env-provided token.",
    "Motoko backend stores all application data in in-memory Map structures (profiles, files, transfers, AI results, QR sessions).",
    "QR sharing is modeled as a session object with validity + expiry, stored server-side and enforced during fetch/validate/invalidate operations.",
    "Backend includes a “Caffeine storage” mixin for blob lifecycle/GC and authorized gateway management, relying on external cashier/gateway principals via env vars.",
    "PWA support added (manifest + service worker) with explicit registration to enable installability and offline-capable UX flows.",
    "Offline sharing mode implemented as separate dashboard/components with client-side packaging/saving utilities (no canister dependency for the offline flow).",
    "Frontend template/tooling includes custom ESLint rules (e.g., prohibiting BigInt in React Query keys and enforcing InternetIdentityProvider usage) alongside a vendored shadcn/ui component library for consistent UI primitives.",
    "Build-template and core components were refreshed to newer component versions (authorization/blob-storage v4.0.0, core-infrastructure v1.0.2) with corresponding updates across backend/frontend and deploy tooling (icp.yaml/deploy.sh/Dockerfile)."
  ],
  "known_issues": [
    "AI image compression is performed client-side; backend compressImage currently only records a result and returns the original blob (no real server-side compression).",
    "Backend stores full file blobs directly in canister memory and accepts them as single arguments; this will not scale to large files due to IC message/canister memory constraints (no chunking/streaming).",
    "Environment variable name for the storage cashier principal appears misspelled as \"CAFFFEINE_STORAGE_CASHIER_PRINCIPAL\" (triple 'F'), which may cause deployment/configuration errors.",
    "Two different global CSS files are present (frontend/index.css and frontend/src/index.css) with different token sets; this can cause styling/theme inconsistency depending on bundler config.",
    "Online/offline presence is updated on mount/unmount only; abrupt tab closes or network loss may leave stale “online” state until the user reconnects or profile is updated."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "OFS",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}